# Арифметические операторы
print("5 + 6 =", 5+6)
print("5 - 6 =", 5-6)
print("5 * 6 =", 5*6)
print("5 / 6 =", 5/6)
print("2 в степени 5 =", 2**5)
print("квадратный корень из 16 =", 16**0.5)
print("целочисленное деление числа 7 на 3 =", 7//3)
print("остаток от деления числа 7 на 6 =", 7%6)

# Сокращения операторов, работает для всех операторов
# a = a + 4 можно сократить до a += 4
a=5
a+=4
print("a = 5\na = a + 4\na =", a)

# побитовые операции
# >> сдвиг вправо
# << сдвиг влево
# & побитовое и
# | побитовое или
# ~ побитовое не