# Последовательности - это списки, кортежи, строки
str = "Строка"
# Получить фрагмент последовательности
print("str[1:3]", str[1:3])       # тр
print("str[-1]", str[-1])         # а
print("str[-2]", str[-2])         # к
print("str[2:]", str[2:])         # рока
print("str[1:-1]", str[1:-1])     # трок
print("str[:]", str[:])           # Строка
# С шагом
print("str[::2]", str[::2])       # Срк
print("str[::-1]", str[::-1])     # акортС
print("str[::3]", str[::3])       # Со
# То же самое применимо к спискам и кортежам
list = ["Стол", "Диван", "Шкаф", "Кресло"]
print("list[-1]", list[-1])       # Кресло
print("list[::-1]", list[::-1])   # ["Кресло", "Шкаф", "Диван", "Стол"]
