# Оффициальный сайт: https://www.python.org/
# При установке обязательно поставить галочку для добавления пути в переменные среды PATH.
# Проверка работает ли Python:
# WIN+R Откырть окно выполнить, Ввести cmd и нажать Enter
# В командной строке выполнить: python -V или python3 -V
# Если видим версию значит Python установлен правильно.
# Найти программу IDLE в поиске (она доступна после установки Python). Открыть и можно писать код. Или создать файл (CTRL+N) и писать код в файле, а запускать его с помощью F5. Так же можно в командной строке выполнить команду python, появятся >>> и тут можно так же писать код и запускать его нажав Enter.
# Ввести: print("Hello, World!") и запустить этот код.
# Установить редактор VS Code. Поставить расширения: Python и Jupyter. Для написания кода нужно создать файл с расширением .py открыть терминал CTRL+` и запускать код прямо в редакторе с помощью CTRL+F5
# Первая программа
print("Hello, World!")